desktop/Desktop.org
#+startup: overview
#+title: Desktop Environment
#+property: header-args :mkdirp yes

* Table Of Contents
:PROPERTIES:
:TOC:      :include all
:END:
:CONTENTS:
- [[#table-of-contents][Table Of Contents]]
- [[#about][About]]
- [[#fonts-and-themes][Fonts and Themes]]
- [[#window-management][Window Management]]
  - [[#exwm-config][EXWM config]]
    - [[#ivy-posframe][Ivy-posframe]]
    - [[#helper-functions][Helper functions]]
    - [[#init-hook][Init hook]]
    - [[#configure-exwm-via-use-package][Configure exwm via use-package]]
    - [[#start-server][Start server]]
  - [[#desktop-key-bindings][Desktop Key Bindings]]
  - [[#desktop-file][Desktop File]]
  - [[#launcher-script][Launcher Script]]
  - [[#polybar][Polybar]]
- [[#applications][Applications]]
  - [[#browsers][Browsers]]
    - [[#qutebrowser][Qutebrowser]]
  - [[#media-players][Media Players]]
    - [[#mpv][mpv]]
    - [[#mpd][mpd]]
    - [[#mpv-and-mpd-packages][mpv and mpd packages]]
    - [[#codecs-and-drivers][Codecs and Drivers]]
  - [[#image-viewers-and-editors][Image Viewers and Editors]]
  - [[#desktop-tools][Desktop Tools]]
  - [[#system-tools][System Tools]]
  - [[#xorg-tools][Xorg Tools]]
  - [[#dev-tools][Dev tools]]
- [[#guix-manifests][Guix Manifests]]
:END:

* About
This file contains configuration for some =packages= I use, =manifestst= for GUIX package manager and =EXWM= config.
Hightly inspired by [[https://www.youtube.com/channel/UCAiiOTio8Yu69c3XnR7nQBQ][System Crafters]] YouTube channel and configs of other people.

* Fonts and Themes
I use [[https://github.com/derat/xsettingsd][xsettingsd]] as a minimal settings daemon for Xorg applications.  It replaces similar daemons from desktop environments like GNOME and XFCE and enables me to use a simple configuration file like the following:

#+begin_src conf :tangle ~/dotfiles/xsettingsd/.config/xsettingsd/xsettingsd.conf :noweb yes
  # Net/ThemeName "Matcha-dark-azul"
  # Net/ThemeName "numix"
  Net/ThemeName "Arc-Dark"
  Net/IconThemeName "Papirus-Dark"
  # Net/IconThemeName "Papirus-Light"
  Gtk/DecorationLayout "menu:minimize,maximize,close"
  Gtk/FontName "Cantarell 12"
  Gtk/MonospaceFontName "Fira Mono 12"
  Gtk/CursorThemeName "Adwaita"
  Xft/Antialias 1
  Xft/Hinting 0
  Xft/HintStyle "hintnone"
#+end_src

I also have to do an extra step to make sure Emacs can find the font path from the "desktop" profile.

#+begin_src xml :tangle ~/dotfiles/fontconfig/.config/fontconfig/fonts.conf
  <?xml version="1.0"?>
  <!DOCTYPE fontconfig SYSTEM "fonts.dtd">
  <fontconfig>
    <dir>~/.guix-extra-profiles/desktop/desktop/share/fonts</dir>
    <!-- Disable bitmap fonts. -->
    <!-- <selectfont><rejectfont><pattern> -->
    <!--   <patelt name="scalable"><bool>false</bool></patelt> -->
    <!-- </pattern></rejectfont></selectfont> -->
  </fontconfig>
#+end_src

:GUIX-PACKAGES:
#+begin_src scheme :noweb-ref themes :noweb-sep ""
  ;; Settings Manager
  "xsettingsd"

  ;; GTK Themes
  "numix-gtk-theme"
  "nordic-theme"
  "arc-theme"
  "arc-icon-theme"
  "matcha-theme"
  "gnome-themes-standard"
  "hicolor-icon-theme"
  "gnome-icon-theme"
  "gnome-backgrounds"
  "papirus-icon-theme"
  "guix-simplyblack-sddm-theme"

  "murrine"
#+end_src

#+begin_src scheme :noweb-ref packages :noweb-sep ""
  ;; Fonts
  "font-mononoki"
  "font-fira-mono"
  "font-fira-code"
  "font-abattis-cantarell"
  "font-dejavu"
  "font-iosevka"
  "font-adobe-source-code-pro"
  ;; "font-google-noto" ; large file (~700 mb)
  "font-google-roboto"
  "font-gnu-freefont"
  "font-liberation"
  "font-awesome"
  "font-google-material-design-icons"
  "gs-fonts"

  "fontmanager"
  "fontconfig"
#+end_src
:END:

* Window Management
We use the excellent [[https://github.com/ch11ng/exwm][EXWM]] module as the basis for our Emacs Desktop Environment. The [[https://github.com/ch11ng/exwm/wiki][EXWM Wiki]] is a great place to find tips about how to configure everything!

*NOTE:* Make sure you’ve installed =nm-applet=, =pasystray= and =blueman= for the system tray apps to work!

** EXWM config
*** Ivy-posframe

#+begin_src emacs-lisp :tangle ~/dotfiles/emacs/.config/emacs/main-config/desktop.el
  (use-package ivy-posframe
    :after ivy
    :custom
    (ivy-posframe-display-functions-alist
     '((swiper          . ivy-posframe-display-at-point)
       (complete-symbol . ivy-posframe-display-at-point)
       (counsel-M-x     . ivy-posframe-display-at-window-bottom-left)
       (t               . ivy-posframe-display)))
    (ivy-posframe-parameters 
     '((alpha . 80)                                   
       ;; (parent-frame nil)
       (left-fringe . 7)                                                   
       (right-fringe . 7)))
    :config 
    (ivy-posframe-mode 1))
#+end_src

*** Helper functions

#+begin_src emacs-lisp :tangle ~/dotfiles/emacs/.config/emacs/main-config/desktop.el
  (defun efs/run-in-background (command)
    (let ((command-parts (split-string command "[ ]+")))
      (apply #'call-process `(,(car command-parts) nil 0 nil ,@(cdr command-parts)))))
  
  (defun efs/set-wallpaper ()
    (interactive)
    ;; NOTE: You will need to update this to a valid background path!
    (start-process-shell-command
        "feh" nil  "feh --bg-scale /usr/share/backgrounds/matt-mcnulty-nyc-2nd-ave.jpg"))

  ;; fix for ivy-posframe in x11 windows
  (defun exwm-update-ivy-posframe-parameters (&rest args)
    (interactive)
    (if (equal major-mode 'exwm-mode)
      (progn (setq ivy-posframe-parameters 
        '((parent-frame nil)                                               
          (alpha . 92)                                               
          (left-fringe . 7)                                               
          (right-fringe . 7))))
    (progn (setq-local ivy-posframe-parameters 
      '((alpha . 92)                                   
        (left-fringe . 7)                                                   
        (right-fringe . 7))))))
        
(defun efs/exwm-update-class ()
    (exwm-workspace-rename-buffer exwm-class-name))

(defun efs/exwm-update-title ()
  (pcase exwm-class-name
    ("Nightly" (exwm-workspace-rename-buffer (format "firefox: %s" exwm-title)))
    ("Chromium-browser" (exwm-workspace-rename-buffer (format "chromium: %s" exwm-title)))
    ("qutebrowser" (exwm-workspace-rename-buffer (format "qutebrowser: %s" exwm-title)))))

(defun efs/configure-window-by-class ()
  (interactive)
  (pcase exwm-class-name
    ((or "Nightly" "Chromium-browser" "qutebrowser") (exwm-workspace-move-window 2))
    ;; ("Sol" (exwm-workspace-move-window 3))
    ("mpv" (exwm-floating-toggle-floating)
           (exwm-layout-toggle-mode-line))))
#+end_src
*** Init hook

#+begin_src emacs-lisp :tangle ~/dotfiles/emacs/.config/emacs/main-config/desktop.el
    (defun efs/exwm-init-hook ()
      ;; Make workspace 1 be the one where we land at startup
      (exwm-workspace-switch-create 1)
  
      ;; Open eshell by default
      ;; (eshell)
      ;; (find-file "/sudo:root@localhost:/etc/config.scm")
      ;; (find-file "~/Emacs.org")
      ;; (find-file "~/Desktop.org")
      ;; (vterm)
  
      ;; Show battery status in the mode line
      ;; (display-battery-mode 1)
  
      ;; Show the time and date in modeline
      ;; (setq display-time-day-and-date t)
      ;; (display-time-mode 1)
      ;; Also take a look at display-time-format and format-time-string
  
      ;; Launch panel
      (efs/start-panel)
  
      ;; Launch apps that will run in the background
      ;; (efs/run-in-background "volumeicon")
      ;; (efs/run-in-background "blueman-applet")
      ;; (efs/run-in-background "pasystray")
      ;; (efs/run-in-background "nm-applet")
      )
#+end_src

