emacs/.config/emacs/desktop.el
(defun efs/run-in-background (command)
    (let ((command-parts (split-string command "[ ]+")))
      (apply #'call-process `(,(car command-parts) nil 0 nil ,@(cdr command-parts)))))
  
  (defun efs/set-wallpaper ()
    (interactive)
    ;; NOTE: You will need to update this to a valid background path!
    (start-process-shell-command
        "feh" nil  "feh --bg-scale /usr/share/backgrounds/matt-mcnulty-nyc-2nd-ave.jpg"))

  ;; fix for ivy-posframe in x11 windows
  (defun exwm-update-ivy-posframe-parameters (&rest args)
    (interactive)
    (if (equal major-mode 'exwm-mode)
      (progn (setq ivy-posframe-parameters 
        '((parent-frame nil)                                               
          (alpha . 92)                                               
          (left-fringe . 7)                                               
          (right-fringe . 7))))
    (progn (setq-local ivy-posframe-parameters 
      '((alpha . 92)                                   
        (left-fringe . 7)                                                   
        (right-fringe . 7))))))
        
(defun efs/exwm-update-class ()
    (exwm-workspace-rename-buffer exwm-class-name))

(defun efs/exwm-update-title ()
  (pcase exwm-class-name
    ("Nightly" (exwm-workspace-rename-buffer (format "firefox: %s" exwm-title)))
    ("Chromium-browser" (exwm-workspace-rename-buffer (format "chromium: %s" exwm-title)))
    ("qutebrowser" (exwm-workspace-rename-buffer (format "qutebrowser: %s" exwm-title)))))

(defun efs/configure-window-by-class ()
  (interactive)
  (pcase exwm-class-name
    ((or "Nightly" "Chromium-browser" "qutebrowser") (exwm-workspace-move-window 2))
    ;; ("Sol" (exwm-workspace-move-window 3))
    ("mpv" (exwm-floating-toggle-floating)
           (exwm-layout-toggle-mode-line))))

(defun efs/exwm-init-hook ()
  ;; Make workspace 1 be the one where we land at startup
  (exwm-workspace-switch-create 1)

  ;; Open eshell by default
  ;; (eshell)
  ;; (find-file "/sudo:root@localhost:/etc/config.scm")
  ;; (find-file "~/Emacs.org")
  ;; (find-file "~/Desktop.org")
  ;; (vterm)

  ;; Show battery status in the mode line
  ;; (display-battery-mode 1)

  ;; Show the time and date in modeline
  ;; (setq display-time-day-and-date t)
  ;; (display-time-mode 1)
  ;; Also take a look at display-time-format and format-time-string

  ;; Launch panel
  (efs/start-panel)

  ;; Launch apps that will run in the background
  ;; (efs/run-in-background "volumeicon")
  ;; (efs/run-in-background "blueman-applet")
  ;; (efs/run-in-background "pasystray")
  ;; (efs/run-in-background "nm-applet")
  )
