emacs/.config/emacs/desktop.el

(use-package exwm
  :config
  ;; Set the default number of workspaces
  (setq exwm-workspace-number 5)

  ;; When window "class" updates, use it to set the buffer name
  (add-hook 'exwm-update-class-hook #'efs/exwm-update-class)

  ;; When window title updates, use it to set the buffer name
  (add-hook 'exwm-update-title-hook #'efs/exwm-update-title)

  ;; Configure windows as they're created
  (add-hook 'exwm-manage-finish-hook #'efs/configure-window-by-class)

  ;; apply ivy-posframe fix for x11 windows
  ;; (add-to-list 'exwm-mode-hook 'exwm-update-ivy-posframe-parameters)
  ;; (advice-add 'set-window-buffer :after 'exwm-update-ivy-posframe-parameters)
  ;; (add-to-list 'ivy-posframe-parameters '(parent-frame nil))

  ;; For polybar
  ;; (add-hook 'exwm-workspace-list-change-hook
  ;;       #'exwm-workspace--update-ewmh-desktop-names)

  ;; When EXWM starts up, do some extra configuration
  (add-hook 'exwm-init-hook #'efs/exwm-init-hook)

  ;; Startup
  ;; (start-process-shell-command "xset" nil "xset r rate 300 50")
  ;; (start-process-shell-command "xsetroot" nil "xsetroot -cursor_name left_ptr")
  ;; (start-process-shell-command "picom" nil "picom")
  ;; (start-process-shell-command "nitrogen" nil "nitrogen --restore")
  ;; (start-process-shell-command "xsettingsd" nil "xsettingsd")
  ;; (start-process-shell-command "mpdris2" nil "mpdris2")
  ;; (start-process-shell-command "mpd" nil "mpd")

  ;; Load the system tray before exwm-init
  ;; (require 'exwm-systemtray)
  ;; (exwm-systemtray-enable)

  ;; These keys should always pass through to Emacs
  (setq exwm-input-prefix-keys
        '(?\C-x
          ?\C-u
          ?\C-h
          ?\M-x
          ?\M-`
          ?\M-&
          ?\M-:
          ?\M-!
          ?\C-\M-j  ;; Buffer list
          ?\C-\ ))  ;; Ctrl+Space

  ;; Ctrl+Q will enable the next key to be sent directly
  (define-key exwm-mode-map [?\C-q] 'exwm-input-send-next-key)

  ;; Set up global key bindings.  These always work, no matter the input state!
  ;; Keep in mind that changing this list after EXWM initializes has no effect.
  (setq exwm-input-global-keys
        `(;; Reset to line-mode (C-c C-k switches to char-mode via exwm-input-release-keyboard)
          ([?\s-r] . exwm-reset)

          ;; Move between windows
          ([s-left] . windmove-left)
          ([?\s-h] . windmove-left)
          ([s-right] . windmove-right)
          ([?\s-l] . windmove-right)
          ([s-up] . windmove-up)
          ([?\s-k] . windmove-up)
          ([s-down] . windmove-down)
          ([?\s-j] . windmove-down)

          ;; Launch applications via shell command
          ([?\s-&] . (lambda (command)
                       (interactive (list (read-shell-command "$ ")))
                       (start-process-shell-command command nil command)))

          ;; Switch workspace
          ([?\s-w] . exwm-workspace-switch)
          ([?\s-`] . (lambda () (interactive)
                       (exwm-workspace-switch-create 0)))

          ;; 's-N': Switch to certain workspace with Super (Win) plus a number key (0 - 9)
          ,@(mapcar (lambda (i)
                      `(,(kbd (format "s-%d" i)) .
                        (lambda ()
                          (interactive)
                          (exwm-workspace-switch-create ,i))))
                    (number-sequence 0 9))))

  ;; (exwm-input-set-key (kbd "s-SPC") 'counsel-linux-app)

  ;; Resize windows
  (defmacro efs/resize-helper (resize-window-function)
    (let ((delta 5))
      `(lambda () (interactive) (,resize-window-function ,delta))))

  (exwm-input-set-key (kbd "s-[") (efs/resize-helper shrink-window-horizontally))
  (exwm-input-set-key (kbd "s-{") (efs/resize-helper shrink-window))
  (exwm-input-set-key (kbd "s-]") (efs/resize-helper enlarge-window-horizontally))
  (exwm-input-set-key (kbd "s-}") (efs/resize-helper enlarge-window))

  (exwm-enable))

(server-start)

(use-package desktop-environment
  :after exwm
  :config (desktop-environment-mode)
  :custom
  (desktop-environment-brightness-small-increment "1%+")
  (desktop-environment-brightness-small-decrement "1%-")
  (desktop-environment-brightness-normal-increment "1%+")
  (desktop-environment-brightness-normal-decrement "1%-")
  (desktop-environment-screenshot-command "flameshot gui"))
