desktop/Desktop.org
** Polybar

#+begin_src emacs-lisp :tangle ~/dotfiles/emacs/.config/emacs/main-config/desktop.el
  (defvar efs/polybar-process nil
    "Holds the process of the running Polybar instance, if any")
  
  (defun efs/kill-panel ()
    (interactive)
    (when efs/polybar-process
      (ignore-errors
	(kill-process efs/polybar-process)))
    (setq efs/polybar-process nil))
  
  (defun efs/start-panel ()
    (interactive)
    (efs/kill-panel)
    (setq efs/polybar-process (start-process-shell-command "polybar" nil "polybar panel")))
  
  (defun efs/polybar-exwm-workspace ()
    (pcase exwm-workspace-current-index
      (0 "")
      (1 "")
      (2 "")
      (3 "")
      (4 "")))
  
  (setq exwm-workspace-index-map
	(lambda (index)
	  (let ((named-workspaces ["code" "brow" "extr" "slac" "lisp"]))
	    (if (< index (length named-workspaces))
		(elt named-workspaces index)
	      (number-to-string index)))))
  
  (defun exwm-workspace--update-ewmh-desktop-names ()
    (xcb:+request exwm--connection
		  (make-instance 'xcb:ewmh:set-_NET_DESKTOP_NAMES
				 :window exwm--root :data
				 (mapconcat (lambda (i) (funcall exwm-workspace-index-map i))
					    (number-sequence 0 (1- (exwm-workspace--count)))
					    "\0"))))
#+end_src

#+begin_src conf :tangle ~/dotfiles/polybar/.config/polybar/config :noweb yes
  ; Docs: https://github.com/polybar/polybar
  ;==========================================================
  
  [settings]
  screenchange-reload = true
  
  [global/wm]
  margin-top = 0
  margin-bottom = 0
  
  [colors]
  background = #f0232635
  background-alt = #576075
  foreground = #A6Accd
  foreground-alt = #555
  primary = #ffb52a
  secondary = #e60053
  alert = #bd2c40
  underline-1 = #c792ea
  
  [bar/panel]
  width = 100%
  height = 35
  offset-x = 0
  offset-y = 0
  fixed-center = true
  enable-ipc = true
  
  background = ${colors.background}
  foreground = ${colors.foreground}
  
  line-size = 2
  line-color = #f00
  
  border-size = 0
  border-color = #00000000
  
  padding-top = 5
  padding-left = 1
  padding-right = 1
  
  module-margin = 1
  
  font-0 = "Cantarell:size=12:weight=bold;2"
  font-1 = "Font Awesome:size=13;2"
  font-2 = "Material Icons:size=15;3"
  font-3 = "Fira Mono:size=13;-3"
  
  modules-left = 
  modules-right = xkeyboard date battery
  
  tray-position = right
  tray-padding = 2
  tray-maxsize = 28
  
  cursor-click = pointer
  cursor-scroll = ns-resize
  
  [module/ewmh]
  type = internal/xworkspaces
  
  ; Only show workspaces defined on the same output as the bar
  ;
  ; Useful if you want to show monitor specific workspaces
  ; on different bars
  ;
  ; Default: false
  pin-workspaces = true
  
  ; Create click handler used to focus desktop
  ; Default: true
  enable-click = false
  
  ; Create scroll handlers used to cycle desktops
  ; Default: true
  enable-scroll = false
  
  icon-0 = noll;🙃
  
  icon-1 = ett;⚀
  
  icon-2 = två;⚁
  
  icon-3 = tre;⚂
  
  icon-4 = fyra;⚃
  
  icon-5 = fem;⚄
  
  icon-6 = sex;⚅
  
  icon-default = ☐
  
  [module/exwm-workspace]
  type = custom/ipc
  hook-0 = emacsclient -e "(efs/polybar-exwm-workspace)" | sed -e 's/^"//' -e 's/"$//'
  initial = 1
  format-underline = ${colors.underline-1}
  format-padding = 1
  
  [module/cpu]
  type = internal/cpu
  interval = 2
  format = <label> <ramp-coreload>
  format-underline = ${colors.underline-1}
  click-left = emacsclient -e "(proced)"
  label = %percentage:2%%
  ramp-coreload-spacing = 0
  ramp-coreload-0 = ▁
  ramp-coreload-0-foreground = ${colors.foreground-alt}
  ramp-coreload-1 = ▂
  ramp-coreload-2 = ▃
  ramp-coreload-3 = ▄
  ramp-coreload-4 = ▅
  ramp-coreload-5 = ▆
  ramp-coreload-6 = ▇
  
   [module/xkeyboard]
  type = internal/xkeyboard
  
  ; List of indicators to ignore
  blacklist-0 = num lock
  blacklist-1 = scroll lock
	      
  [module/date]
  type = internal/date
  interval = 5
  
  date = "%a %b %e"
  date-alt = "%A %B %d %Y"
  
  time = %l:%M %p
  time-alt = %H:%M:%S
  
  format-prefix-foreground = ${colors.foreground-alt}
  format-underline = ${colors.underline-1}
  
  label = %date% %time%
  
  [module/battery]
  type = internal/battery
  battery = BAT0
  adapter = ADP1
  full-at = 98
  time-format = %-l:%M
  
  label-charging = %percentage%% / %time%
  format-charging = <animation-charging> <label-charging>
  format-charging-underline = ${colors.underline-1}
  
  label-discharging = %percentage%% / %time%
  format-discharging = <ramp-capacity> <label-discharging>
  format-discharging-underline = ${self.format-charging-underline}
  
  format-full = <ramp-capacity> <label-full>
  format-full-underline = ${self.format-charging-underline}
  
  ramp-capacity-0 = 
  ramp-capacity-1 = 
  ramp-capacity-2 = 
  ramp-capacity-3 = 
  ramp-capacity-4 = 
  
  animation-charging-0 = 
  animation-charging-1 = 
  animation-charging-2 = 
  animation-charging-3 = 
  animation-charging-4 = 
  animation-charging-framerate = 750
  
  [module/temperature]
  type = internal/temperature
  thermal-zone = 0
  warn-temperature = 60
  
  format = <label>
  format-underline = ${colors.underline-1}
  format-warn = <label-warn>
  format-warn-underline = ${self.format-underline}
  
  label = %temperature-c%
  label-warn = %temperature-c%!
  label-warn-foreground = ${colors.secondary}
#+end_src

* Applications
** Browsers
*** Qutebrowser
[[https://github.com/qutebrowser/qutebrowser][Qutebrowser]] is a great keyboard-centric browser which uses the Chromium rendering engine via QT 5's WebEngine component.  I've configured it to act more like Vimb for window-per-tab behavior that integrates well into Emacs.  One thing I like about this browser is that it does a much better job of remembering what windows you had open when it exits so that you can maintain your session more easily.  I also like that when you reopen a tab/window, the history of that window is still present.

#+begin_src python :tangle ~/dotfiles/qutebrowser/.config/qutebrowser/config.py :noweb yes
  # Load settings configured via GUI
  config.load_autoconfig()

  # c.auto_save.session = True
  c.scrolling.smooth = True
  c.session.lazy_restore = True
  c.content.autoplay = False

  c.fonts.default_size = "14pt"

  # Scale pages and UI better for hidpi
  c.zoom.default = "120%"
  c.fonts.hints = "bold 16pt monospace"

  # Better default fonts
  c.fonts.web.family.standard = "Bitstream Vera Sans"
  c.fonts.web.family.serif = "Bitstream Vera Serif"
  c.fonts.web.family.sans_serif = "Bitstream Vera Sans"
  c.fonts.web.family.fixed = "Fira Mono"
  c.fonts.statusbar = "14pt Cantarell"

  # Use dark mode where possible
  c.colors.webpage.darkmode.enabled = True
  c.colors.webpage.bg = "black"

  # Automatically turn on insert mode when a loaded page focuses a text field
  c.input.insert_mode.auto_load = True

  # Make Ctrl+g quit everything like in Emacs
  config.bind('<Ctrl-g>', 'mode-leave', mode='insert')
  config.bind('<Ctrl-g>', 'mode-leave', mode='command')
  config.bind('<Ctrl-g>', 'mode-leave', mode='prompt')
  config.bind('<Ctrl-g>', 'mode-leave', mode='hint')

  # Some other bindings
  config.bind(',m', 'hint links spawn mpv {hint-url}')
#+end_src

:GUIX-PACKAGES:
#+begin_src scheme :noweb-ref packages :noweb-sep ""
  "qutebrowser"
#+end_src
:END:

** Media Players
*** mpv
[[https://mpv.io/][mpv]] is a simple yet powerful video player.  Paired with [[http://ytdl-org.github.io/youtube-dl/][youtube-dl]] it can even stream YouTube videos.  [[https://github.com/hoyon/mpv-mpris][mpv-mpris]] allows playback control via [[https://github.com/altdesktop/playerctl][playerctl]].

#+begin_src conf :tangle ~/dotfiles/mpv/.config/mpv/mpv.conf :noweb yes
  # Configure playback quality
  # vo=gpu
  # hwdec=vaapi
  # profile=gpu-hq
  # scale=ewa_lanczossharp
  # cscale=ewa_lanczossharp
  
  # Start the window in the upper right screen corner
  geometry=22%-30+20
  
  # Save video position on quit
  save-position-on-quit
  
  # Enable control by MPRIS
  script=~/.guix-extra-profiles/desktop/desktop/lib/mpris.so
  
  # Limit the resolution of YouTube videos
  ytdl=yes
  ytdl-format=bestvideo[height<=?720]+bestaudio/best
  
  # When playing audio files, display the album art
  audio-display=attachment
  
  # Keep the player open after the file finishes
  keep-open
#+end_src

*** mpd
[[https://github.com/MusicPlayerDaemon/MPD][Music Player Daemon]] (MPD) is a flexible, powerful, server-side application for playing music. Through plugins and libraries it can play a variety of sound files while being controlled by its network protocol.

#+begin_src conf :tangle ~/dotfiles/mpd/.config/mpd/mpd.conf :noweb yes
  # Recommended location for database
  db_file            "~/.local/mpd/database"
  
  # Logs to systemd journal
  # log_file           "syslog"
  
  # The music directory is by default the XDG directory, uncomment to amend and choose a different directory
  music_directory    "~/Music"
  
  # Uncomment to refresh the database whenever files in the music_directory are changed
  auto_update "yes"
  
  restore_paused "yes"
  
  port "6600"
  
  # Uncomment to enable the functionalities
  playlist_directory "~/.local/mpd/playlists"
  #pid_file           "~/.local/mpd/pid"
  state_file         "~/.local/mpd/state"
  sticker_file       "~/.local/mpd/sticker.sql"
  
  # audio_output {
  #     type "alsa"
  #     name "My Alsa Device"
  #     mixer_type "software"
  # }
#+end_src

*** mpv and mpd packages
:GUIX-PACKAGES:
#+begin_src scheme :noweb-ref packages :noweb-sep ""
  "mpv"
  "mpv-mpris"
  "youtube-dl"
  "mpd"
  "mpdris2"
  "ncmpcpp"
  "playerctl"
#+end_src
:END:

*** Codecs and Drivers
These packages are needed to enable many video formats to be played in browsers and video players.  VAAPI drivers are also used to enable hardware-accelerated video decoding.

:GUIX-PACKAGES:
#+begin_src scheme :noweb-ref packages :noweb-sep ""  
  "gstreamer"
  "gst-plugins-base"
  "gst-plugins-good"
  "gst-plugins-bad"
  "gst-plugins-ugly"
  "gst-libav"
  "intel-vaapi-driver"
  "libva-utils"  
#+end_src
:END:

** Image Viewers and Editors
:GUIX-PACKAGES:
#+begin_src scheme :noweb-ref packages :noweb-sep ""
  "feh"
  "imv"
  "gimp"
  "scrot"
#+end_src
:END:

** Desktop Tools
[[https://github.com/jonls/redshift][Redshift]] adjusts the color temperature of your screen according to your surroundings. This may help your eyes hurt less if you are working in front of the screen at night.

#+begin_src conf :tangle ~/dotfiles/redshift/.config/redshift/redshift.conf :noweb ye
  [redshift]
  location-provider=manual
  
  [manual]
  lat=48.862831
  lon=25.003870
#+end_src

:GUIX-PACKAGES:
#+begin_src scheme :noweb-ref packages :noweb-sep ""
  "picom"
  "light"
  "brightnessctl"
  "nitrogen"
  "polybar"
  "pavucontrol"
  "pasystray"
  "volumeicon"
  "blueman"
  ;; "compton"
  "redshift-wayland"
  ;; "gucharmap"
  "fontmanager"
  "xdg-utils"      ;; For xdg-open, etc
  "xdg-dbus-proxy" ;; For Flatpak
  "gtk+:bin"       ;; For gtk-launch
  "glib:bin"       ;; For gio-launch-desktop
  "shared-mime-info"
  "rofi"
  "wofi"
  ;; "waybar"
  "swayidle"
  ;; "swaylock"
  "wl-clipboard"
  "mako"
  "grim"
  "slurp"
  "xdg-desktop-portal"
  "xdg-desktop-portal-wlr"
  "flameshot"
  "evince"
  "deluge"
  "libreoffice"
  "telegram-desktop"
  "qalculate-gtk"
  "pcmanfm"
  ;; "foot"
  "slock"
  "i3lock"
  ;; xmonad stuff
  "xmonad"
  "xmobar"
  "ghc-xmonad-contrib"
  "ghc@8.6.5"
  "ghc-hostname"
  "stalonetray"
  "dunst"
#+end_src
:END:

** System Tools
:GUIX-PACKAGES:
#+begin_src scheme :noweb-ref packages :noweb-sep ""
  "btrfs-progs"
  "htop"
  "curl"
  "wget"
  "openssh"
  "zip"
  "unzip"
  "stow"
#+end_src
:END:

** Xorg Tools
:GUIX-PACKAGES:
#+begin_src scheme :noweb-ref packages :noweb-sep ""
  "xev"
  "xprop"
  "xdotool"
  "xset"
  "xsetroot"
  "xrdb"
  "xhost"
  "xmodmap"
  "setxkbmap"
  "xrandr"
  "arandr"
  "xss-lock"
  "libinput"
  "xinput"
  "xscreensaver"
#+end_src
:END:

** Dev tools
:GUIX-PACKAGES:
#+begin_src scheme :noweb-ref packages :noweb-sep ""
  "fish"
  "python"
  "ncurses"
#+end_src
:END:

* Guix Manifests
The =desktop.scm= manifest holds the list of packages that I use to configure my desktop environment.  The package names are pulled from the relevant sections titled *Guix Packages* in this file (=Desktop.org=).

#+begin_src scheme :tangle ~/dotfiles/guix/.config/guix/manifests/themes.scm :noweb yes
(specifications->manifest
 '(
   <<themes>>
))
#+end_src

#+begin_src scheme :tangle ~/dotfiles/guix/.config/guix/manifests/desktop.scm :noweb yes
(specifications->manifest
 '(
   <<packages>>
))
#+end_src
