emacs/.config/emacs/desktop.el

(defvar efs/polybar-process nil
  "Holds the process of the running Polybar instance, if any")

(defun efs/kill-panel ()
  (interactive)
  (when efs/polybar-process
    (ignore-errors
      (kill-process efs/polybar-process)))
  (setq efs/polybar-process nil))

(defun efs/start-panel ()
  (interactive)
  (efs/kill-panel)
  (setq efs/polybar-process (start-process-shell-command "polybar" nil "polybar panel")))

(defun efs/polybar-exwm-workspace ()
  (pcase exwm-workspace-current-index
    (0 "")
    (1 "")
    (2 "")
    (3 "")
    (4 "")))

(setq exwm-workspace-index-map
      (lambda (index)
	(let ((named-workspaces ["code" "brow" "extr" "slac" "lisp"]))
	  (if (< index (length named-workspaces))
	      (elt named-workspaces index)
	    (number-to-string index)))))

(defun exwm-workspace--update-ewmh-desktop-names ()
  (xcb:+request exwm--connection
		(make-instance 'xcb:ewmh:set-_NET_DESKTOP_NAMES
			       :window exwm--root :data
			       (mapconcat (lambda (i) (funcall exwm-workspace-index-map i))
					  (number-sequence 0 (1- (exwm-workspace--count)))
					  "\0"))))
